{
    "graph": [
        {"id": "starting", "name": "on the road", "north":{"node": "explore1", "distance": 1}},
        {"id": "explore1", "name": "materials", "east":{"node": "vampires1", "distance": 1}, "west":{"node":"werewolves1", "distance":1}},
        {"id": "vampires1", "name": "the first attack", "east":{"node": "boostattack", "distance": 1}, "north":{"node": "sirens", "distance": 1}, "west":{"node":"explore1", "distance":1}},
        {"id": "werewolves1", "name": "the first attack", "west": {"node": "alpha", "distance": 1},"east": {"node": "explore1", "distance":1}, "south":{"node": "boosthp", "distance":1}},
        {"id": "boostattack", "name": "Attack Amplification", "west":{"node": "vampires1", "distance": 1}},
        {"id": "sirens", "name": "yet another attack", "south":{"node": "vampires1", "distance": 1},"west":{"node": "boostmag", "distance": 1}},
        {"id": "alpha", "name": "alpha wolf", "north":{"node": "boostdef", "distance": 1},"east":{"node": "werwolves1", "distance": 1}},
        {"id": "boosthp", "name": "HP Amplification", "north":{"node":"werewolves1", "distance": 1}},
        {"id": "boostmag", "name": "Magical Amplification", "east":{"node":"sirens", "distance": 1}, "west": {"node":"rest", "distance":1}, "north":{"node":"dragon", "distance":1}},
        {"id": "rest", "name": "place to rest", "east":{"node": "boostmag", "distance":1},"west":{"node":"boostdef", "distance":1},"north":{"node":"dragon", "distance":1}},
        {"id": "boostdef","name": "Defense Amplification", "east":{"node": "rest", "distance":1}, "south":{"node":"alpha", "distance":1}},
        {"id": "dragon", "name": "Dragon Fight"}
    ],
    "round": {
        "win-condition":{
            "source": "roundboss",
            "condition":{
                "type": "comparison",
                "left": "hp",
                "right": "0",
                "symbol": "<="
            }
        },
        "lose-condition":{
            "source": "player",
            "condition":{
                "type": "comparison",
                "left":"hp",
                "right":"0",
                "symbol":"<="
            }
        }
    },
    "vampires": {
        "win-condition":{
            "source": "vampire5",
            "condition":{
                "type": "comparison",
                "left": "hp",
                "right": "0",
                "symbol": "<="
            },
            "triggers":{
                "effect":{
                    "addStatus":"has beaten"
                }
            }
        },
        "lose-condition":{
            "source": "player",
            "condition":{
                "type": "comparison",
                "left":"hp",
                "right":"0",
                "symbol":"<="
            }
        }
    },
    "rooms":{
        "starting":{
            "description":{
                "default": "It was time to go out and save the world from strife far too powerful to withstand without your helping hands. You grabbed your belongings you deemed necessary, stretched out your arms, flexed your hands, and went out.<br><br>This was a time that was very make-it-up-as-you-go. Sure, it helped that you knew a few places nearby that reportedly were abundant with either portals or monsters...or both. But say you handled all of those. Would it be able to be finished then? Or, the more likely option, you'd have to go elsewhere. When could it be done? How would you be certain it was done?<br><br>You'd get there when you'd get there. One step at a time, right?<br><br>You see only one path ahead...straight to the North."
            }
        },
        "explore1":{
            "description":{
                "default": "The world appeared inclined to supply its only hope of help, as you would so modestly call yourself. You had come across an area composed of various debris from what had been department stores. Now, it looked worse for wear than a ghost town...which admittedly, may be more true than you'd like. You would have to be at complete attention, for that was the only way to prepare for what may happen in the next moment. To your right were the remains of a grocery store, while to your left lay chunks of rocks and some rope.",
                "conditionals":{
                    "has explored": "The world appeared inclined to supply its only hope of help, as you would so modestly call yourself. You had come across an area composed of various debris from what had been department stores. Now, it looked worse for wear than a ghost town...which admittedly, may be more true than you'd like. You would have to be at complete attention, for that was the only way to prepare for what may happen in the next moment. There was less to use around you, now.<br><br>The street leading west from here looked as if rampaging beasts had demolished the walls that stood in their way, whereas the street leading east held an air of ominosity and...threat to it.",
                    "has fainted": "You awoke the very place you began, atop all of the rubble. Which, now that you were aware of it, was very uncomfortable. How you got here, you couldn't be certain, but at least you weren't dead. And everything looked...pretty much the same in comparison to when you last saw it. Including the paths east and west of you."
                },
                "items": [
                    {
                        "id": "food",
                        "name": "from grocery store",
                        "triggers":[
                            {
                                "action": "pickup",
                                "effect":{
                                    "addStatus": "has food",
                                    "target": "round"
                                }
                            },
                            {
                                "action": "drop",
                                "effect": {
                                    "removeStatus": "has food",
                                    "target": "round"
                                }
                            },
                            {
                                "action": "eat",
                                "effect": {
                                    "removeStatus": "has food",
                                    "addStatus": "restoreHealth",
                                    "target": "round"
                                }
                            }
                        ],
                        "destination": "inventory"
                    },
                    {
                        "id": "stones",
                        "name": "from rubble",
                        "triggers":[
                            {
                                "action": "pickup",
                                "effect":{
                                    "addStatus": "has explored",
                                    "target": "round"
                                }
                            }
                        ],
                        "destination": "inventory",
                        "damage": 2
                    }
                ]
            }
        },
        "vampires1":{
            "description":{
                "default": "Before too long you were met with a sight only suitable for nightmares and horror movies. A crew of vampires was hunched over a pile of silhouettes with faces frozen in terror, eyes wide-open and jaws locked into a scream. They had to have been placed haphazardly, or perhaps thrown.<br><br>The vampires were better for better for wear, minus the blood stained faces and clothes (though there was the unnecessary-to-speak truth of the blood not being their own). They all appeared to catch wind of you simultaneously, their heads snapping up and turning to you. There was a hungry look in their eyes, as if a full course meal hadn't come close to satiating them. They looked starved. A few dared to direct menacing smiles your way.<br><br>As they started to waltz closer to you, it became clear that there was five of them. If you didn't know any better, you'd think they'd owned the place. Like everything and everyone that could ever be was all there for them.<br><br>As if...<br><br>You felt your energy rise, power flooding through your veins and threatening to spill uncontrollably past the surface. They were cocky, drunk on newfound souls that they left beaten and broken. It was time that they were challenged. Send them back from whence they came, and hopefully worse.<br><br>A figure with dark hair and red, beady eyes that glinted with malicious intent began its approach. Perhaps they were the leader of this crew? No matter. Red dripped from their lips and scattered down the front of their clothes, making them look a bit like a (deranged) toddler. Their tantrum would be coming to a close.",
                "conditionals":{
                    "has beaten": "Things may not feel complete, but they did feel righter. The air may have been easier to breathe, or you were simply less breathless. But as you looked around at the area, eyes falling upon the lives disregarded by the unwelcome guests, you felt some sense of peace. Like you had restored something for them.",
                    "has fainted": "You awoke where you had beaten the fanged cretins, luckily away from the pile of bodies that had been there when you first arrived. You could feel chills cascade down your spine and shuddered at the thought. Things were...still the same as they were. You still had a chance. And you would use up any chance you could get. You still had the paths to your east, north, and west from here."
                },
                "npcs":[
                    {
                        "id": "vampire1",
                        "name": "the leading vampire",
                        "details": "A figure with dark hair and red, beady eyes that glinted with malicious intent. Red dripped from their lips and scattered down the front of their clothes, looking a bit like a (deranged) toddler.",
                        "stats":{
                            "attack":29,
                            "magical": 5,
                            "defense":17,
                            "HP": 50,
                            "damage1": 8,
                            "damage2":10
                        }                
                    },
                    {
                        "id": "vampire2",
                        "name": "a vampire",
                        "details": "It appeared as if no one had introduced them to sunscreen yet, nasty-looking burns covering splotches of skin. Much like their predecessor, their eyes were also red, and they made no hesitation in baring their fangs.",
                        "stats":{
                            "attack":29,
                            "magical": 5,
                            "defense":17,
                            "HP": 50,
                            "damage1": 8,
                            "damage2":10
                        }                
                    },
                    {
                        "id": "vampire3",
                        "name": "another vampire",
                        "details": "Much unlike the first two, this one had eyes like a storm. And what you could only presume to be a bone in their hands crackled like lightning, an unamused gaze falling upon you. No- forget unamused- murderous was what you were really looking for.",
                        "stats":{
                            "attack":29,
                            "magical": 5,
                            "defense":17,
                            "HP": 50,
                            "damage1": 8,
                            "damage2":10
                        }                
                    },
                    {
                        "id": "vampire4",
                        "name": "the one that's too much like an animal",
                        "details": "You would've been more inclined to think that this one was a shifter; they looked and sounded completely animalistic. Their hair went in every direction, even standing up on its ends. Their nails were filed to more resemble claws, even their feet were bare to show off talon-like toenails.",
                        "stats":{
                            "attack":29,
                            "magical": 5,
                            "defense":17,
                            "HP": 50,
                            "damage1": 8,
                            "damage2":10
                        }                
                    },
                    {
                        "id": "vampire5",
                        "name": "the last one standing",
                        "details": "Watching brethren in blood fall one-by-one was not something this one seemed to be taking very well. He threw his head back and screamed, leaving your blood and bones rattling and shaking you to your core.",
                        "stats":{
                            "attack":29,
                            "magical": 5,
                            "defense":17,
                            "HP": 50,
                            "damage1": 8,
                            "damage2":10
                        }                
                    }
                ]
            }
        },
        "werewolves1":{
            "description":{
                "default": "As you started down the ruined street, you could practically feel countless pairs of eyes glaring sharpened daggers into your skin. Whoever, or whatever, was stalking you like prey was not bothering in being stealthy about it. You wouldn't dare say that you respect them for their brazen nature, but at least you were in for an interesting time. <br><br>The further you went, the less distinguishable the houses were from the pothole-ridden streets. Clear and unnecessary demolition, and for what? Your irritation was reaching its peak, and the growling behind you was just impeccable. <br><br> It started with a single voice and grew into a chorus. When you turned on your heel you were faced with five grand masses of fur, all in a line and prowling inches and inches closer. For a moment, it appeared that none would break formation. <br><br> But just for a moment. A sandy-colored wolf threw its head back into a howl before lurching towards you.",
                "conditionals":{
                    "has beaten": "Time was all that was necessary to rebuild all that had been lost, here. Time and care, which you hoped your efforts would open the opportunity of. Hopefully these nightmarish and outlandish creatures wouldn't be able to just return the way they first came. Hopefully there was a timer of sorts, and it was giving you hefty amounts of time. From here was the west, the east, and the south.",
                    "has fainted": "You felt groggy as your eyes fluttered open, awareness spiraling around you until you were almost too dizzy to stand up. What on earth had happened? How did you get back here? ...At least you were back here for another round. That could've gone worse, right? It could've gone better- but this time around it definitely will. You had the west, the east, and the south to go from here."
                },
                "npcs":[
                    {
                        "id": "werewolf1",
                        "name": "the presumed beta",
                        "details": "",
                        "stats":{
                            "attack":7,
                            "magical": 10,
                            "defense":20,
                            "HP": 50,
                            "damage1": 8,
                            "damage2":10
                        }                
                    },
                    {
                        "id": "werewolf2",
                        "name": "a monstrous wolf",
                        "details": "All you could see dashing towards you was a giant red flag that promised bloodshed. Literally- the wolf's fur was the perfect shade of blood, so much that you doubted it was natural. Was it possible for werewolves to dye their fur in Purgatory, or was it a recent development? ...Hopefully it was something like hair dye and not a result of them wrecking the town.",
                        "stats":{
                            "attack":7,
                            "magical": 10,
                            "defense":20,
                            "HP": 50,
                            "damage1": 8,
                            "damage2":10
                        }                
                    },
                    {
                        "id": "werewolf3",
                        "name": "madness",
                        "details": "If any of the wolves in this crew had rabies, it would be this one. It may not have been foaming at the mouth, but it lacked any sense of tame or control that the previous two had.",
                        "stats":{
                            "attack":7,
                            "magical": 10,
                            "defense":20,
                            "HP": 50,
                            "damage1": 8,
                            "damage2":10
                        }                
                    },
                    {
                        "id": "werewolf4",
                        "name": "chaos",
                        "details": "While the previous may have lacked control, this one certainly basked in true chaos. It made its movements unpredictable, although deliberately so. It had to have some cognition of what it was doing, and you figured this one's job was to make their prey confused.",
                        "stats":{
                            "attack":7,
                            "magical": 10,
                            "defense":20,
                            "HP": 50,
                            "damage1": 8,
                            "damage2":10
                        }               
                    },
                    {
                        "id": "werewolf5",
                        "name": "always the quiet ones",
                        "details": "Silence was the only true distinction of this one from the others. They had howled, an equivalent of whooping and hollering, whether it be while attacking or edging the others on. This one was completely quiet, even now. And in its silence, there was a challenge. Perhaps this was the last of them here, but there was no intent to go down without a fight. And if it could, it would be bringing you to Purgatory with it.",
                        "stats":{
                            "attack":7,
                            "magical": 10,
                            "defense":20,
                            "HP": 50,
                            "damage1": 8,
                            "damage2":10
                        }              
                    }
                ]
            }
        },
        "boostattack":{
            "description":{
                "default": "The vampires had been a pain in the neck. And everywhere else their disgusting teeth and talons had touched. It made their (surely inevitable) defeat all the more satisfying. At least the bloodsuckers couldn't turn you, if that even was a thing. You had grown so accustomed to the humans' various interpretations that you weren't sure which, if any, were correct. You hoped that that hadn't been a tactic used to lure the more naive humans to their doom, a desire to be like their various and romanticized depictions.<br><br>Either way, there was no fooling you, just as there was no manipulating your current genetic makeup to anything Purgatory-level of monstrous. Perhaps you were the very foil necessary to keep the world from spontaneously combusting under their otherwise overwhelming pressure.<br><br>You were hopeful that at least something akin to that was the case. Even if you weren't a usual optimist, this was a circumstance that made it more ideal than realism or pessimism could ever dream to be. If you kept fighting for it, something good would come out of it. Even if it meant saving one place, or one person...that's better off than what it would be otherwise. If you just sat down and accepted the entire downfall. BUT you would be saving more than one place, more than one person, even if they weren't right here and now. Humans often said that hardwork paid off, right?<br><br>This little getaway from the main stretch proved to be no exception. Although much of what you had seen thus far has been lacking in any notable visual excitement, you were baffled at the difference there was here. It didn't seem so...dead. There were petals from trees and flowers alike, strewn all about the ground. They were torn, yes, but even then, some bushes and greenery still remained on the sides of the streets. They were a small echo of what they were, but there still remained a resemblance there.<br><br>Out of interest, you knelt down, sweeping up some of the petals in your hand, all brightly colored as if they were freshly fallen. When you clasped your hand lightly around them, you started to feel a slight hum at your fingertips. It spread quickly down the lengths of your fingers and into your palm. The next thing you knew, the buzz was whirring in each of your limbs. You felt as if you could lift what remained of your hometown in one swoop. You felt like you could take on anything that dared to fisticuffs with you.<br><br>With that said, you definitely had to continue onwards now, and the only way to do that was to return to the west.",
                "conditionals":{
                    "has explored": "You wondered if a massive windstorm had swept through the area since you last arrived, somehow undetected by you in your travels. For though the greenery that lined the streets still remained, the scattered petals were nowhere to be seen, and the trees that plentiful had likely fallen from were now completely barren. It was very strange- and that had to be saying something at this point.<br><br>It was something you must consider further, but later. You could still only go west from here.",
                    "has fainted": "You could've sworn you had been awoken by the wind practically slapping you, however when you sat up, everything around you was impossibly still. You didn't know what you believed less, the fact that you were knocked out, or the fact that you were back here. Well, there was still only one way to go- to the west."
                }
            }
        },
        "sirens":{
            "description":{
                "default": "Walking into this area resembled strolling onto a stage that was subject to a fog machine, impeccable placement that didn't go past some invisible boundaries set. As if there weren't enough red flags around this place enough as it was. But perhaps the most alarming thing? You didn't feel alarmed...at all.<br><br>There was an air of tranquility that flitted about you. It was what you breathed and all you could see and hear. You felt at peace. Like everything was going to be alright. Diving deeper was the best option, the only option, and you started to grow more comfortable. The tenseness in your shoulders involuntarily relaxed, your heartbeat slowed, and a wistful smile started to sprout from the corners of your lips. It didn't meet your eyes.<br><br>Because internally, you could feel the turmoil, the panic as to what this may mean. It was so unlike anything you had experienced before. You knew it must've meant trouble, but you felt trapped in your own body. Like you weren't the one controlling it, but just inhabiting it, using it as a way of getting around. You wanted to look around and keep aware of your surroundings, but even if you could snap out of the trance at this point, you doubted you would be able to see very much. Even the ground two feet ahead of you was the pearly white density of a cloud. <br><br>When you stepped on it, it wisped away, momentarily curling around the lengths of your feet before darting off to who knew where. More trouble, more strife, more...singing?<br><br>You didn't know when it had started, but you didn't want it to stop. It was the most soothing set of voices you had ever been exposed to. Even as it rang in your ears, it was like small, satisfying bell chimes. <br><br>Luckily, it was also all you needed to snap out of it. If this was anything like what the humans experienced, well...you were happy with your lineage. You would be far gone to the Call of the Sirens by now, and most likely met with the ugly ensnaring teeth they hid behind their alluring smiles. You could sense one on its way to you, now. Still singing, but it sounded its true nature, now. Threatening, frightening, no-escaping. For you, and little beknownst to them, for them.<br><br>The nearest was twirling in the fog, looking to be floating, but it must have been so dense enough she could swim in it. She embodied all that you found to be most beautiful, down to the smallest of details. It was unsettling to think about how they come about finding this knowledge...But as soon as she saw your eyes and how they were not glossy or trance-induced, her own look turned steely. The skin at the tips of her fingers turned to scales, and the major key she had been singing in turned minor. As though she had leapt off a diving board, she went up before hurdling downwards towards you.",
                "conditionals":{
                    "has beaten": "You could see clearly now, which was as troubling as it was relieving. Before, you couldn't see how heartwrenching quiet and lifeless looked. You couldn't see the deafening influence of the sirens. But at least now you could see. And that had to mean something, right? There were two places to go from here. The west and the south, where the former felt closer to...the heart of the problem.",
                    "has fainted": "Fatigued, it take you a few moments to regain your senses enough to know where you were. The area that had been foggy and siren-infested before was a different level of creepily serene, but you were glad that there weren't any unwanted visitors to greet you. There was still so much to do. You had two directions from here- the south and the west."
                },
                "npcs":[
                    {
                        "id": "siren1",
                        "name": "getting the party started",
                        "details": "",
                        "stats":{
                            "attack":20,
                            "magical": 20,
                            "defense":5,
                            "HP": 65,
                            "damage1": 15,
                            "damage2":18
                        }                
                    },
                    {
                        "id": "siren2",
                        "name": "a different kind of beauty",
                        "details": "Although they all could've very well looked the exact same, and it was what you had anticipated based on the first's, this siren had all the same features but none of equal stylings. She was a variant, a breakthrough of one being just as beautiful but in a starkly different way. All the way down to her snake-like eyes and the forked tongue that you were sure had to be venomous. Just based on your luck alone.",
                        "stats":{
                            "attack":20,
                            "magical": 20,
                            "defense":5,
                            "HP": 65,
                            "damage1": 15,
                            "damage2":18
                        }                
                    },
                    {
                        "id": "siren3",
                        "name": "grayscale",
                        "details": "You were curious as to how long this one had actually been left undetected by you, for her gray skin made her look more like a statue than something alive, even now as she waltzed towards you. Everything to her was composed of varying shades of gray, and the fog warping around you even shifted to match. Confident lips forced into a smile to show jagged, shark-like teeth.",
                        "stats":{
                            "attack":20,
                            "magical": 20,
                            "defense":5,
                            "HP": 65,
                            "damage1": 15,
                            "damage2":18
                        }                
                    },
                    {
                        "id": "siren4",
                        "name": "more colorful than a rainbow",
                        "details": "Colors, vibrant and dull, and most consisting of ones you had never seen before. Even the hair that sprung from her head was inconsistent with each strand, the color of her irises their own sea that you could get hypnotized should you stare for too long. You could see what resembled veins covering the lengths of her arms, but even those shifted ever few moments. You could never be sure what you were staring at, and perhaps that was the point.",
                        "stats":{
                            "attack":20,
                            "magical": 20,
                            "defense":5,
                            "HP": 65,
                            "damage1": 15,
                            "damage2":18
                        }               
                    },
                    {
                        "id": "siren5",
                        "name": "i haven't the foggiest idea",
                        "details": "Fog swirled around them, covering them like the clothing on their back. If you had to guess, this was the main source of the fog of the area, for evry bit around you started to twist and turn. It had the same affect of standing in the waves of an ocean, making you feel like you were moving when you were certain you were standing still. With each of their steps, more fog exuded from their fingertips, their barefeet a ghostly pale. You couldn't distinguish what was cloud and what was them. All that you could be certain of was their milky white eyes that held all and no emotion.",
                        "stats":{
                            "attack":20,
                            "magical": 20,
                            "defense":5,
                            "HP": 65,
                            "damage1": 15,
                            "damage2":18
                        }              
                    },
                    {
                        "id": "siren6",
                        "name": "sharper than a knife",
                        "details": "The surroundings grew to be more visible, and you were left in the company of two remaining sirens. The one closest had earrings that surpassed even the length of her hair, which spiked up towards the top. A lot of her features seemed pointed- her nose, her ears, the shoes she wore that seemed to match the throwing knife she twirled impatiently in her hand. There was no doubt in your mind that the shoes could hurt as much as the blatant weapon, though you doubted she needed either.",
                        "stats":{
                            "attack":20,
                            "magical": 20,
                            "defense":5,
                            "HP": 65,
                            "damage1": 15,
                            "damage2":18
                        }              
                    },
                    {
                        "id": "siren7",
                        "name": "will hold you captive",
                        "details": "The last one standing made no immediate moves, even as the last of their presumed crew fell flat and faded away at your feet. Their dark complexion combined with their silver, shimmering eyes offered a sight that could've brought any tired traveler to the brink. You imagined this was the one that had caused most ships from older times to wreck, the one that heroes in myths heard and screamed and shouted to reach. Even you, after fighting off six already, questioned if it was necessary to defeat a seventh. You could fall back into what you felt in the very beginning- secure, comfort, and all tensions departing from you.",
                        "stats":{
                            "attack":20,
                            "magical": 20,
                            "defense":5,
                            "HP": 65,
                            "damage1": 15,
                            "damage2":18
                        }              
                    }
                ]
            }
        },
        "alpha":{
            "description":{
                "default": "This area was in more shambles than the one to its east, looking like a newly renovated ghost town. Not even the wind in the trees dared to make a sound. You could just as quickly believe you had been warped into one of the silent films you had heard older humans referencing. But this was...even more intense than that. You felt as if the sounds of your inner thoughts were being viciously torn from you, leaving your mind in an equivalent state to your surroundings.<br><br>It shook you from the outside going in. You had never had to endure an earthquake, but you imagined this is what it would feel like at its most extreme. You wondered if the ground beneath your feet would open up to swallow you whole. You wondered if there was such a creature to cause that, or if this was just some ground-breaking creature you had stumbled upon.<br><br>You weren't left to your imagination for too long, however. There was a menacing, low rumble that you feared could have negative influence on your heartbeat. You could even feel it in your stomach, and it was worse than any illness that you've had to face. It seemed to stem from everywhere, but...your attention was caught just to the left of you. You weren't sure why at first. But then the power emanating from that point spoke for itself. Finally, you could make out the glints of eyes. Just a single pair, but mighty heavens above and fiery hells below.<br><br>It was always so frustrating when people in shows and movies froze. So many problems could at least have the possibility of being solved if they just moved, but it turned out there was something that could make you completely forget about your own two feet. Medusa may as well be standing right in front of you, staring into your eyes and making you a part of her decor. Try as you might, your legs were numb, your heart was definitely racing, and you felt like a deer caught in headlights.<br><br>The further it emerged, the more urgent your thoughts grew, though that meant so little here and now. This werewolf was like none you had ever seen. Not only was it taller, but it seemed wiser. It was more in control, more tactical, less impulsive. You wished this was an area you had explored during the day, because in the night, left with no light except the flickering flames of your determination...the wolf was so difficult to see.<br><br>This must be an alpha. <br><br>If it wasn't- well then you definitely didn't want to meet one. The growling finally stopped only when it bounded towards you, somehow making traveling on four feet for part of the way and two feet for the other part seemless.",
                "conditionals":{
                    "has beaten": "Still in shambles, but there was something more...lively to it. You couldn't put your finger on the reason why, but your spirits were lifted moreso than the first time you came around. You felt more at ease and far less sick. If anything you felt better than you had during this whole escapade. From here, you can go to the north or to the east.",
                    "has fainted": "At least upon waking up here, you didn't feel nearly as sick as you had during your encounter with the alpha. You rubbed at the back of your head, mindlessly checking to make sure you were still altogether and not any more maimed than you last recalled. Everything felt decently intact, besides maybe your pride. But that was fine, you could still manage, and even that would definitely be restored in time. From here, you could go to the north or to the east."
                },
                "npcs":[
                    {
                        "id": "alpha1",
                        "name": "mini-boss",
                        "details": "",
                        "stats":{
                            "attack":25,
                            "magical": 20,
                            "defense":40,
                            "HP": 115,
                            "damage1": 26,
                            "damage2": 26
                        }                
                    }
                ]
            }
        },
        "boosthp":{
            "description":{
                "default": "The group of werewolves on its own was enough to wear you down. You thanked whatever lucky stars you could think of that their ravenous bites had no influence over you. You didn't know what you would do if all of a sudden you were covered in fur splotches and were forced to move with a pack that was composed of who knew the sort. There seemed to be more food scattered here, which you launched yourself towards right away. It wasn't worth packing away for later with how starved and drained you felt. The irony of how much you likely looked like an animal in this moment failed to escape you, but you didn't pay it any attention besides rolling your eyes.<br><br>It was curious, though. Had something been done with this food? It did more than satiate an innate hunger. The moment it was in your mouth for you to chew, you felt something stir in you. Everything felt properly aligned. You felt...healthier? Any of what you just endured was washed away, prickling pain now just an echo of what it had been.<br><br>You looked around to ensure no unwelcome visitors were present, trying to tune further into your surroundings to grasp for prying eyes. But there was nothing more to be seen. There was nothing to harm you here. So...who had put this here? It couldn't have been any humans- you hadn't seen any and you figured they would've treated something like this as a big deal. There was no way you wouldn't have heard of it if it was a thing on Earth. There was something more at work here.<br><br>After you were done munching on the food present, you confirmed that you could only go back up north from here.",
                "conditionals":{
                    "has explored": "Well...from the very least, you could confirm the food didn't appear on its own. There was no sign of substanance, nor anymore sign of life. It was a shame based on the presumed good magic it had done to you previously, but you guess you were glad that it had happened at all. <br><br>North was still the only direction to proceed.",
                    "has fainted": "You awoke with a start, the first breath hard to find, as if you had been on the brink of death only to be revived. Barely. But then breathing grew easier, and you looked around in earnest of where you had landed. This was the place that made you feel healthier- go figure- and there was only north to go from here."
                }
            }
        },
        "boostmag":{
            "description":{
                "default": "It was at quiet, wandering moments like these that led you to your own thoughts. There was nothing to be said, but everything to be noticed. Had it been getting increasingly warmer the longer you went on, or was this only a recent development? If it was the latter, than it had gotten to a point near-unbearable very fast. You knew days could get to be sweltering and unpleasant without the help of Purgatory's unruly beasts, but this was on a whole other level.<br><br> It was difficult to breathe, and despite you just walking, you could feel rows of beads of sweat form on your brow, your neck, your back...only to feel like it was sizzling on their paths down. You hoped it wasn't possible to be dehydrated, especially not so quickly. How easy it would be to jump you if you were passed out on the ground.<br><br> It wasn't something to dwell over, but the further you walked, the more the contemplation creeped into your head, wrapping around your mind and making your head pulse. Your mouth started to feel dryer and dryer, the sensation continuing into your throat. Coughing did nothing for you, besides making it feel worse. Was it possible to fight under such conditions?<br><br>You would have to find some way- there was no other option at this point. To the north you could see the colorful flames undoubtedly resulting in these irritable sensations. You couldn't go there like this, but the only other places you could go were the east and the west, with the latter somehow appearing much nicer than where you were now, despite being adjacent to it.<br><br>Just as you started to consider the best trail to track, you heard thunder roar in the skies above. You hadn't noticed the gray clouds before, but they were all the sky was comprised of now. A split second was all it took for rain to start pouring down from above. The droplets didn't seem to even touch the fire, but they were so welcome to you. So cold, so reinvigorating.<br><br>Out of an innate instinct, you tipped your head back and opened your mouth, the rain soothing you from the inside out. There was no longer worries about the heat being too much for you to handle. You would go so far to say that this did more than your lineage did, which left you curious and...uncertain. Just as quickly as it came, it was done. The fire roared on, and you could practically hear its laughter.<br><br>However, you were...fine? Despite how fast your skin and clothes dried, you did not feel impacted by the heat as you had been just moments ago. New energy surged through you.",
                "conditionals":{
                    "has explored": "There were no more signs of rain, no matter how long you tried to wait it out. A part of you wanted to scream at the sky for being stingy, but the last thing you needed now was to be robbed of what it had given you for being &#8220;ungrateful.&#8221; The fact of the matter was, you weren't, but it would certainly be nice to have more considering the great struggle that undoubtedly lay ahead! ...There was no point in thinking about it, especially when you needed a clear head to continue on effectively and efficiently.<br><br>There was the fiery north, the relaxing west, and the seemingly serene east from this point.",
                    "has fainted": "It felt as if you had just blinked. One moment, you were in the heat of battle, the next, you were here. You felt better than you had, but you hoped there wasn't a cost to it. At the moment, you were grateful to even be waking up here at all, despite the unfond memories of the degree of its warmth. At least you didn't wake up sweating buckets like you could've, otherwise. You could venture north, east, and west from here."
                }
            }
        },
        "rest":{
            "description":{
                "default": "Everything felt so...balanced, here. Where everything else was extreme chaos and loss, gray and grave, you felt something different, here. Somehow, this little area had been left completely untouched. It was peaceful- it must've been hidden. But you couldn't tell how.<br><br>You couldn't tell how it made you feel at ease, and yet aware, empowered, yet only just beginning. You felt as if it was safe to rest here, even if that sounded ridiculous anywhere else, it didn't. Not here. And so, you set what remained of your belongings down on the ground and lay down, drifting off to a simple slumber.<br><br>And when you awoke, still everything was untouched, there was nothing out of place. The only worry you felt was inspired by the seemingly increasing smoke and fire to the north. Both paths to the east and west definitely paled in comparison, not necessarily being as pleasant as this area was, but not being nearly as awful as what the northern area held.",
                "has fainted": "How poetic it was to awake at the resting place, itself. At least you didn't have to worry about anything unwelcome poking in, as you were practically 100% sure that no one else could access this hideaway. Not that you'd dare complain, it helped to give you time to decide the next best move. From here was the east, the west, and the north."
            }
        },
        "boostdef":{
            "description":{
                "default": "After all you've endured thus far, you've come to wish for more durable clothing. Or maybe a change of clothes you cared less about, considering the only time you'd wear these ones now would be a future costume party. Maybe for pajamas. Only time could tell. <br><br>Either way, where you currently stood, Global Warming felt to be too literal of a term, but it was the best fit. Earlier on in the journey you felt a number of chills, and while not all of them were from being cold, you definitely hadn't been this warm. Even standing still, you were breaking a sweat. Which was...a bit alarming, to be honest. You were never quick to perspire or feel fatigue before, but things were different now. Look off further into the distance, you could see an alarming amount of smoke.<br><br>That would be the pinnacle, wouldn't it? The be-all-end-all of your hometown. Total mayhem, or hope for restoration? Fear that you were majorly ignoring up until this point settled into your gut. You knew that you had been doing all you could, but would that be enough to defeat whatever Smokey-The-Bear-Defying-Beast waited for you now? Could you stop the fire from spreading, or would it all end here with Earth's Last Defenses?<br><br>You tried to physically shake it off, from your head to your toes, knowing it would only do your enemy good if you tore yourself apart from the inside out. In doing so, something ahead of you caught your eye.<br><br>At first it had looked like one of the portals you were all too accustomed with, but the longer you stared at it expectantly, the less recognizable it was. You started walking towards it, uncertain as to what exactly was possessing you to do so. The next thing you knew, pieces of armor started flying through haphazardly like loose shrapnel, skidding to a halt nearby your feet. When you looked back up, the portal was gone.<br><br>...Well, there was certainly someone out there that was sponsoring your victory. From here was the east which looked like a good place to setup camp, and the wreckage to the south.",
                "conditionals":{
                    "has explored": "There were no other signs of portals anywhere, which was a relief to an extent. You wouldn't complain if more helpful items were to just pop up out of nowhere, but you doubted that would happen again. If whoever it was planned to give you anything more, than they likely would've originally. You would just have to trust that it was enough to get this job done. And if not- you'd find whoever it was and haunt them relentlessly.<br><br>From here was the east which looked like a good place to setup camp, and the wreckage to the south.",
                    "has fainted": "The clang of metal rings in your ears to wake you from your improper slumber. You turn over, looking around expectantly for the cause of it, but it seems as though it was used as an alarm. As if being knocked out wasn't a sign you needed more armor...your self-called sponsors didn't look to believe so. You huffed and looked around one last time, confirming that there was only the east and south directions to take, and nothing else to see."
                }
            }
        },
        "dragon":{
            "description":{
                "default": "No turning back now...<br><br>Fire was turning everything to ash, the &#8220;sturdier&#8221; structures caving in and piling behind you. Smoke drifted towards the sky, lighting up with the louder crackles and pops you heard from everything being dismantled. Piece by piece. Quite honestly, you were sick of the state everything was in. How broken down and helpless it all seemed.<br><br>Not helpless anymore. You promised it before, and you would promise it again. Thins may seem at such an extreme rate of disrepair, but things could be fixed. Lost lives may not be found, but properly laid to rest. Able to rest knowing that no one else would endure such pain. This was a one-time-only type of problem.<br><br>You were more prepared than ever before. You had taken down other creatures of mass destruction to find your way here, at last, and not even a fire breathing dragon could stop you now. And, as it would turn out, you were not too far off.<br><br>You heard (and felt) a flap of mighty wings overhead. For a moment, the sun disappeared. The wingspan alone had to be at least as wide as a skyscraper was tall, its body even longer. At least it would be hard to miss...right?<br><br>You took a defensive stance as it prepared to land, although as soon as it did the ground that was previously surrounding you turned to water. The fire heightened and burned hotter, changing colors for what would be a magnificent sight if not for all the death and destruction that led to it and stemmed from it. Unblinking eyes focused onto each of the ripples that were caused by you falling in. You may as well be a miniscule skipping stone to this thing, and you knew that had to be one of its plans, if you could even last being touched by the insane set of teeth it had.<br><br>What was up with Purgatory and its children creatures' teeth?",
                "conditionals":{
                    "has beaten": "Victory has been met officially in your home. Your very home. But there was more to do if you wanted to save the entire world."
                },
                "npcs":[
                    {
                        "id": "dragon",
                        "name": "final boss",
                        "details": "",
                        "stats":{
                            "attack":35,
                            "magical": 30,
                            "defense":60,
                            "HP": 500,
                            "damage1": 50,
                            "damage2": 50
                        }                
                    }
                ]
            }
        }
    }
}